"use client";

import WhiteCard from "@/components/WhiteCard";


export default function Terms() {
    return (
        <WhiteCard>
            <div className="flex flex-col gap-4">
                < h1 className="text-[2rem] font-medium -mb-2" > Для правовласників</h1>
                <h4 className="h4">Діяльність сайту AniFlow здійснюється відповідно до законодавства України в галузі захисту інформації та авторських прав на контент.</h4>
                <p>Всі розміщені на ресурсі матеріали знаходяться у вільному доступі та можуть бути безкоштовно завантажені з інтернету. Збір інформації в мережі та розміщення контенту в каталозі здійснюється в автоматичному режимі.</p>
                <p>Публікація неліцензійного, викраденого контенту та матеріалів, захищених авторським правом, не допускається. Адміністрація розміщує лише аматорські україномовні матеріали із вільних джерел під час використання автоматичної системи.</p>
                <p>На сайті AniFlow публікуються лише фрагменти матеріалів, перекладені українською мовою, а також контент із аматорським перекладом для ознайомлювального перегляду. Розміщення оригінальних, неперекладених матеріалів неможливе.</p>
                <p>Адміністрація ресурсу пропонує співпрацю з правовласниками контенту. У разі порушення прав власності, сайт зобов'язується прибрати неправомірно розміщений матеріал або запропонувати вигідні умови співпраці правовласнику.</p>
                <p>Якщо ви виявили матеріал, представлений на нашому сайті, який порушує ваші авторські права, або дискредитує Вашу компанію, надаючи неправильну або спотворену інформацію, будь ласка, зв'яжіться з нами для вирішення цього питання.</p>
                <p>Для цього необхідно надіслати e-mail з вашої корпоративної поштової скриньки, що містить:</p>
                <ul className="list-disc pl-8">
                    <li>контактні дані, реквізити вашої компанії;</li>
                    <li>пряме посилання(посилання) на матеріал, який ви вважаєте спірним;</li>
                    <li>завірені скановані копії документів, що підтверджують ваше ексклюзивне право на матеріал;</li>
                    <li>у випадку, якщо ви представляєте інтереси іншої компанії – копії документів на посередницькі послуги;</li>
                </ul>
                <p>На адресу <a className="text-primary" href="mailto:abuse@aniflow.xyz" target="_blank" rel="noopener noreferrer">abuse@aniflow.xyz</a></p>
                <p>Вся інформація буде перевірена, і адміністрація сайту у найкоротші терміни зв'яжеться з вами для врегулювання спірного питання.</p>
                <p>Дозволи для вбудовування відео</p>
                <ul className="list-disc pl-8">
                    <li>
                        <a target="_blank" rel="noopener noreferrer" href="https://developers.google.com/youtube/terms/api-services-terms-of-service-emea">YouTube.com</a>
                    </li>
                </ul>
            </div>
        </WhiteCard>
    )
}