export function getKawaiiError(
  type: KawaiiErrorType = KawaiiErrorType.Server,
): string {
  const list = kawaiiErrors[type];
  return list[Math.floor(Math.random() * list.length)];
}

export enum KawaiiErrorType {
  Network = "network",
  Server = "server",
  NotFound = "not_found",
  Sync = "sync",
  Api = "api",
  System = "system",
  Unknown = "unknown",
}

const kawaiiErrors: Record<KawaiiErrorType, string[]> = {
  network: [
    "Здається, інтернет пішов по хліб 🥖",
    "Ми втратили сигнал ( ´ ω ` ) 🎶",
    "Упс! Потік даних заблукав у лісі 🌲",
  ],

  server: [
    "Сервер втомився і приліг поспати... 😴",
    "Ой-ой… сервер вирішив трохи подрімати 💤",
    "Наш сервер соромиться і не відповідає 🙈",
    "Сервер пішов на відпочинок 🏋️",
    "Сервер почервонів і втік /// 🏃‍♂️",
    "Сервер робить драматичну паузу 🎭",
    "Сервер випустив катану… і разом із нею відповідь",

    "Щось пішло не за сюжетом… 📺",
    "База даних сказала “не сьогодні” 🙃",
    "Ой! API влаштував страйк ✊",
    "Помилка: магія не спрацювала ✨",
    "Ми не змогли викликати дух API 👻",
    "Помилка: сюжетний поворот занадто сильний для системи",

    "Помилка: забагато емоцій у запиті 💔",
    "Схоже, запит занадто потужний для цього світу 💥",
    "Наш кіт-сервер ліг на клавіатуру 🐈",
    "Схоже, стався критичний “ня” 🐾",

    "Сервер намагається переватиири, що ви хотіли… 🤔",
    "Усе зламалось 👉👈 але не хвилюйся, це тимчасово",
    "Хтось розлив чай на сервер ☕",
  ],

  not_found: [
    "Схоже, аніме втекло в інший всесвіт 🌌",
    "Ми не знайшли це аніме в цій реальності",
    "База даних вдає, що цього аніме не знає 😶",
    "Дані засоромилися і сховалися //",
  ],

  sync: [
    "Щось пішло не за сюжетом… 📺",
    "Помилка синхронізації: таймлайн зламався ⏳",
    "Ми втратили нитку сюжету… спробуй ще раз",
    "Система заплуталась у філерах 📚",
    "База даних сказала “не сьогодні” 🙃",
  ],

  api: [
    "Ой! API влаштував страйк ✊",
    "Помилка: магія не спрацювала ✨",
    "Ми не змогли викликати дух API 👻",
    "Помилка: сюжетний поворот занадто сильний для системи",
  ],

  system: [
    "Помилка: забагато емоцій у запиті 💔",
    "Схоже, запит занадто потужний для цього світу 💥",
    "Наш кіт-сервер ліг на клавіатуру 🐈",
    "Дані пішли на перерву між сезонами 📺",
    "Схоже, стався критичний “ня” 🐾",
    "Помилка завантаження: забагато милоти для одного запиту",
    "Запит занадто милий, система зависла від розчулення 🥺",
  ],

  unknown: [
    "Дані перейшли в режим інкогніто 🕵️‍♀️",
    "Сервер намагається згадати, що ти хотів… 🤔",
    "Усе зламалось, але дуже красиво ✨",
    "Хтось розлив чай на сервер ☕",
  ],
};
