"use client";

import WhiteCard from "@/components/WhiteCard";


export default function Terms() {
    return (
        <WhiteCard>
            <div className="flex flex-col gap-4">
                < h1 className="text-[2rem] font-medium -mb-2" > Політика конфіденційності персональних даних</h1>

                < p>Ця Політика конфіденційності персональних даних (далі-Політика конфіденційності) діє відносно всієї інформації, яку сайт AniFlow, розташований на доменному імені AniFlow.xyz (а також його субдоменах), може отримати про Користувача під час використання сайту AniFlow.xyz (а також його субдоменів), його програм і його продуктів.</p>

                <h4 className="h4">1. Визначення термінів</h4>

                <p><b > 1.1 У цій Політиці конфіденційності використовуються такі терміни:</b > </p>

                <p>1.1.1. "Адміністрація сайту"(далі – Адміністрація) - уповноважені співробітники на управління сайтом AniFlow, які організовують і (або) здійснюють обробку персональних даних, а також визначає цілі обробки персональних даних, склад персональних даних, що підлягають обробці, дії (операції), що здійснюються з персональними даними.</p>

                <p>1.1.2. "Персональні дані" - будь-яка інформація, що відноситься до прямо або побічно визначеному, або визначається фізичній особі (суб'єкту персональних даних).</p>

                <p>1.1.3. "Обробка персональних даних" - будь-яка дія (операція) або сукупність дій (операцій), що здійснюються з використанням засобів автоматизації або без використання таких засобів з персональними даними, включаючи збір, запис, систематизацію, накопичення, зберігання, уточнення (оновлення, зміна), Витяг, використання, передачу (поширення, надання, доступ), знеособлення, блокування, видалення, знищення персональних даних.</p>

                <p>1.1.4. "Конфіденційність персональних даних" - обов'язкова для дотримання Оператором або іншою особою, яка отримала доступ до персональних даних, вимога не допускати їх поширення без згоди суб'єкта персональних даних або наявності іншої законної підстави.</p>

                <p>1.1.5. "Сайт<b> AniFlow </b >" - це сукупність пов'язаних між собою веб-сторінок, розміщених в мережі Інтернет за унікальною адресою (URL): <b>AniFlow.xyz</b>, а також його субдоменах.</p>

                <p>1.1.6. "Субдомени" - це сторінки або сукупність сторінок, розташовані на доменах третього рівня, що належать сайту AniFlow, а також інші тимчасові сторінки, внизу який вказана контактна інформація Адміністрації</p>

                <p>1.1.7. "Користувач сайту<b> AniFlow </b>" (Далі Користувач) – особа, яка має доступ до сайту<b> AniFlow </b>, за допомогою мережі Інтернет і використовує інформацію, матеріали і продукти сайту<b>AniFlow </b>.</p>

                <p>1.1.8. "Cookies" -невеликий фрагмент даних, відправлений веб-сервером і зберігається на комп'ютері користувача, який веб-клієнт або веб-браузер кожен раз пересилає веб-серверу в HTTP-запиті при спробі відкрити сторінку відповідного сайту.</p>

                <p>1.1.9. "IP-адреса" - унікальна мережева адреса вузла в комп'ютерній мережі, через яку користувач отримує доступ на AniFlow.</p>

                <h4 className="h4">2. Загальні положення</h4>

                <p>2.1. Використання Сайту AniFlow Користувачем означає згоду з цією Політикою конфіденційності та умовами обробки персональних даних Користувача.</p>

                <p>2.2. У разі незгоди з умовами Політики конфіденційності Користувач повинен припинити використання сайту AniFlow.</p>

                <p>2.3. Ця Політика конфіденційності застосовується до сайту AniFlow. AniFlow не контролює і не несе відповідальність за сайти третіх осіб, на які користувач може перейти за посиланнями, доступними на сайті AniFlow.</p>

                <p>2.4. Адміністрація не перевіряє достовірність персональних даних, що надаються Користувачем.</p>

                <h4 className="h4">3. Предмет Політики конфіденційності</h4>

                <p>3.1. Ця Політика конфіденційності встановлює зобов'язання адміністрації щодо нерозголошення та забезпечення режиму захисту конфіденційності персональних даних, які Користувач надає за запитом адміністрації при реєстрації на сайті AniFlow або при підписці на інформаційну e-mail розсилку.</p>

                <p>3.2. Персональні дані, дозволені до обробки в рамках цієї Політики конфіденційності, надаються Користувачем шляхом заповнення форм на сайті AniFlow і включають в себе наступну інформацію:</p>
                <ul className="list-unstyled pl-4">
                    <li className="mb-2">3.2.1. прізвище, ім'я, по батькові Користувача;</li>
                    <li className="mb-2">3.2.2. адреса електронної пошти (e-mail)</li>
                    <li className="mb-2">3.2.3. місце проживання користувача (при необхідності)</li>
                    <li className="mb-2">3.2.4. фотографію (при необхідності)</li>
                    <li className="mb-2">3.2.5. Стать (при необхідності)</li>
                </ul>

                <p>3.3. AniFlow захищає дані, які автоматично передаються при відвідуванні сторінок:</p>
                <ul className="list-unstyled pl-4">
                    < li className="mb-2" > - IP адреса;</li>
                    < li className="mb-2" > - інформація З cookies;</li>
                    < li className="mb-2" > - Інформація про браузер;</li>
                    < li className="mb-2" > - час доступу;</li>
                    < li className="mb-2" > - реферер (адреса попередньої сторінки).</li>
                </ul>

                <p>3.3.1. Відключення cookies може спричинити неможливість доступу до частин сайту , що вимагає авторизації.</p>

                <p>3.3.2. AniFlow здійснює збір статистики про IP-адреси своїх відвідувачів. Дана інформація використовується з метою запобігання, виявлення та вирішення технічних проблем.</p>

                <p>3.4. Будь - яка інша персональна інформація неоговоренная вище (історія відвідування, використовувані браузери, операційні системи і т.д.) підлягає надійному зберіганню і нерозповсюдженню, за винятком випадків, передбачених в п. п. 5.2. цієї Політики конфіденційності.</p>

                <h4 className="h4">4. Цілі збору персональної інформації користувача</h4>

                <p>4.1. Персональні дані Користувача адміністрація може використовувати в цілях:</p>
                <p>4.1.1. Ідентифікації користувача, зареєстрованого на сайті AniFlow для його подальшої авторизації.</p>
                <p>4.1.2. Надання Користувачеві доступу до персоналізованих даних сайту AniFlow.</p>
                <p>4.1.3. Встановлення з користувачем зворотного зв'язку, включаючи напрямок повідомлень, запитів, що стосуються використання сайту AniFlow, обробки запитів і заявок від користувача.</p>
                <p>4.1.4. Визначення місця знаходження Користувача для забезпечення безпеки, запобігання шахрайства.</p>
                <p>4.1.5. Підтвердження достовірності та повноти персональних даних, наданих користувачем.</p>
                <p>4.1.6. Створення облікового запису для використання частин сайту AniFlow, якщо Користувач дав згоду на створення облікового запису.</p>
                <p>4.1.7. Повідомлення Користувача по електронній пошті.</p>
                <p>4.1.8. Надання Користувачеві ефективної технічної підтримки при виникненні проблем, пов'язаних з використанням сайту AniFlow.</p>
                <p>4.1.9. Надання Користувачеві з його згоди спеціальних пропозицій, розсилки новин та інших відомостей від імені сайту AniFlow.</p>

                <h4 className="h4">5. Способи і терміни обробки персональної інформації</h4>

                <p>5.1. Обробка персональних даних користувача здійснюється без обмеження терміну, будь-яким законним способом, у тому числі в інформаційних системах персональних даних з використанням засобів автоматизації або без використання таких засобів.</p>

                <p>5.2. Персональні дані Користувача можуть бути передані уповноваженим органам чинного законодавства тільки з підстав і в порядку, встановленим чинним законодавством.</p>

                <p>5.3. При втраті або розголошенні персональних даних Адміністрація має право не інформувати користувача про втрату або розголошення персональних даних.</p>

                <p>5.4. Адміністрація вживає необхідних організаційних і технічних заходів для захисту персональної інформації користувача від неправомірного або випадкового доступу, знищення, зміни, блокування, копіювання, поширення, а також від інших неправомірних дій третіх осіб.</p>

                <p>5.5. Адміністрація спільно з користувачем вживає всіх необхідних заходів щодо запобігання збитків або інших негативних наслідків, викликаних втратою або розголошенням персональних даних Користувача.</p>

                <h4 className="h4">6. Права та обов'язки сторін</h4>

                <p><b>6.1. Користувач має право:</b > </p>

                <p>6.1.1. Приймати вільне рішення про надання своїх персональних даних, необхідних для використання сайту AniFlow, і давати згоду на їх обробку.</p>

                <p>6.1.2. Оновити, доповнити надану інформацію про персональні дані у разі зміни даної інформації.</p>

                <p>6.1.3. Користувач має право на отримання у Адміністрації інформації, що стосується обробки його персональних даних, якщо таке право не обмежене відповідно до федеральних законів. Користувач має право вимагати від Адміністрації уточнення його персональних даних, їх блокування або знищення в разі, якщо персональні дані є неповними, застарілими, неточними, незаконно отриманими або не є необхідними для заявленої мети обробки, а також вживати передбачених законом заходів щодо захисту своїх прав. Для цього достатньо повідомити адміністрацію за вказаною e-mail адресою.</p>

                <p><b>6.2. Адміністрація зобов'язана:</b > </p>

                <p>6.2.1. Використовувати отриману інформацію виключно для цілей, зазначених у п.4 цієї Політики конфіденційності.</p>

                <p>6.2.2. Забезпечити зберігання конфіденційної інформації в таємниці, не розголошувати без попереднього письмового дозволу користувача, а також не здійснювати продаж, обмін, опублікування, або розголошення іншими можливими способами переданих персональних даних Користувача, за винятком п.п. 5.2. цієї Політики конфіденційності.</p>

                <p>6.2.3. Вживати заходів обережності для захисту конфіденційності персональних даних Користувача згідно з порядком, який зазвичай використовується для захисту такого роду інформації в існуючому діловому обороті.</p>

                <p>6.2.4. Здійснити блокування персональних даних, що відносяться до відповідного користувача, з моменту звернення або запиту користувача, або його законного представника або уповноваженого органу із захисту прав суб'єктів персональних даних на період перевірки, у разі виявлення недостовірних персональних даних або неправомірних дій.</p>

                < h4>відповідальність сторін</h4>

                <p>7.1. Адміністрація, не виконала свої зобов'язання, несе відповідальність за збитки, понесені Користувачем у зв'язку з неправомірним використанням персональних даних, відповідно до чинного законодавства, за винятком випадків, передбачених п.п. 5.2. і 7.2. цієї Політики конфіденційності.</p>

                <p>7.2. У разі втрати або розголошення конфіденційної інформації адміністрація не несе відповідальність, якщо дана конфіденційна інформація:</p>
                <p>7.2.1. Стала Публічним Надбанням до її втрати або розголошення.</p>
                <p>7.2.2. Була отримана від третьої сторони до моменту її отримання Адміністрацією ресурсу.</p>
                <p>7.2.3. Була розголошена за згодою користувача.</p>

                <p>7.3. Користувач несе повну відповідальність за дотримання вимог законодавства РФ, в тому числі законів про рекламу, Про захист авторських і суміжних прав, Про охорону товарних знаків і знаків обслуговування, але не обмежуючись перерахованим, включаючи повну відповідальність за зміст і форму матеріалів.</p>

                <p>7.4. Користувач визнає, що відповідальність за будь-яку інформацію (в тому числі, але не обмежуючись: файли з даними, тексти і т.д.), до якої він може мати доступ як до частини сайту AnimeGO, несе особа, яка надала таку інформацію.</p>

                <p>7.5. Користувач погоджується, що інформація, надана йому як частина сайту AnimeGO, може бути об'єктом інтелектуальної власності, права на який захищені і належать іншим користувачам, партнерам або рекламодавцям, які розміщують таку інформацію на сайті AnimeGO.
                    Користувач не має права вносити зміни, передавати в оренду, передавати на умовах позики, продавати, поширювати або створювати похідні роботи на основі такого змісту (повністю або в частині), за винятком випадків, коли такі дії були письмово прямо дозволені власниками такого змісту відповідно до умов окремої угоди.</p>

                <p>7.6. У відношення текстових матеріалів (статей, публікацій, що знаходяться у вільному публічному доступі на сайті AnimeGO) допускається їх поширення за умови, що буде дано посилання на AnimeGO.</p>

                <p>7.7. Адміністрація не несе відповідальності перед Користувачем за будь-який збиток або збиток, понесений користувачем в результаті видалення, збою або неможливості збереження будь-якого змісту та інших комунікаційних даних, що містяться на сайті AnimeGO або передаються через нього.</p>

                <p>7.8. Адміністрація не несе відповідальності за будь-які прямі або непрямі збитки, що відбулися через: використання або неможливості використання сайту, або окремих Сервісів; несанкціонованого доступу до комунікацій Користувача; заяви або поведінку будь-якої третьої особи на сайті.</p>

                <p>7.9. Адміністрація не несе відповідальність за будь-яку інформацію, розміщену Користувачем на сайті AnimeGO, включаючи, але не обмежуючись: інформацію, захищену авторським правом, без прямої згоди власника авторського права.</p>

                <h4 className="h4">8. Вирішення спорів</h4>

                <p>8.1. До звернення до суду з позовом у спорах, що виникають із відносин між Користувачем і адміністрацією, обов'язковим є пред'явлення претензії (письмової пропозиції або пропозиції в електронному вигляді Про добровільне врегулювання спору).</p>

                <p>8.2. Одержувач претензії протягом 30 календарних днів з дня отримання претензії, письмово або в електронному вигляді повідомляє заявника претензії про результати розгляду претензії.</p>


                <p>8.3. До цієї Політики конфіденційності та відносин між Користувачем і адміністрацією застосовується чинне законодавство.</p>

                <h4 className="h4">9. Додаткові умови</h4>

                <p>9.1. Адміністрація має право вносити зміни в цю Політику конфіденційності без згоди Користувача.</p>

                <p>9.2. Нова Політика конфіденційності набуває чинності з моменту її розміщення на сайті AnimeGO, якщо інше не передбачено новою редакцією Політики конфіденційності.</p>

                <p>9.3. Всі пропозиції або питання щодо цієї Політики конфіденційності слід повідомляти за адресою: <a className="text-primary" href=" mailto:animego.org@gmail.com " target=" _blank " >animego.org@gmail.com</a > </p>

                <p>9.4. Діюча Політика конфіденційності розміщена на сторінці за адресою https://animego.xyz/privacy</p>

                < p>Оновлено: 9 Квітня 2026 року</p>

            </div>
        </WhiteCard>
    )
}