namespace AnimeApp.Core.Enums
{

    public enum RelationKindEnum
    {
        Adaptation,          // Адаптація (наприклад, аніме за мангою)
        AlternativeSetting,  // Альтернативний сеттинг
        AlternativeVersion,  // Альтернативна версія (інша інтерпретація історії)
        Character,           // Зв'язок через персонажів 
        FullStory,           // Повна історія (пов'язана повна версія)
        Other,               // Інше (не підпадає під категорії)
        ParentStory,         // Історія-батьківська (оригінальна історія для спін-офу)
        Prequel,             // Пріквел (історія до основної)
        Sequel,              // Сіквел (історія після основної)
        SideStory,           // Сайд-сторі (побічна історія)
        SpinOff,             // Спін-оф (окрема історія від основного сюжету)
        Summary              // Резюме, короткий виклад сюжету
    }

}