"use client";

import WhiteCard from "@/components/WhiteCard";


export default function Terms() {
    return (
        <WhiteCard>
            <div className="flex flex-col gap-4">
                <h1 className="text-[2rem] font-medium -mb-2">Угода користувача</h1>

                <p>Інтернет - ресурс (сайт) aniflow.xyz (надалі - Ресурс) є інтернет-сайтом, що дозволяє користувачам обмінюватися один з одним інформацією про аніме у вільній формі</p>

                <h4 className="h4">1. Про угоду користувача</h4>

                <p>Використовуючи/відвідуючи Ресурс (включаючи весь контент, розміщений на ресурсі), ви погоджуєтесь з цією
                    КОРИСТУВАЛЬНОЮ УГОДАЮ, розміщеною за адресою https://aniflow.xyz/terms.
                    Якщо ви не згодні з будь-яким з пунктів цієї угоди, будь ласка, залиште ресурс.
                    КОРИСТУВАЛЬНА УГОДА може бути змінена Адміністрацією без будь-якого повідомлення користувачів.
                    Нова версія КУ набирає чинності після 3 (трьох) днів з моменту її розміщення, якщо інше не
                    передбачено новою редакцією КОРИСТУВАЛЬНОЇ УГОДИ.</p>

                <h4 className="h4">2. Умови обмеження відповідальності</h4>

                <p>Користувач прямо погоджується з тим, що використовує Ресурс на власний ризик.</p>

                <p>Користувач знає, і згоден з тим, що Ресурс має справу з матеріалами та даними,
                    створеними третіми особами та розміщеними ними в мережі Інтернет на своїх комп'ютерах та (або) серверах.
                    Зміст та безпека цих матеріалів не можуть бути проконтрольовані Адміністрацією Ресурсу, тому остання не несе відповідальності:</p>

                <ul className="pl-4">
                    <li className="mb-2">- за зміст матеріалів, отриманих Користувачем в результаті використання даних з Ресурсу, їх можлива невідповідність чинному законодавству або образливий характер;</li>
                    <li className="mb-2">- за наслідки застосування, використання або невикористання отриманої інформації;</li>
                    <li className="mb-2">- за можливу невідповідність результатів, отриманих при використанні Ресурсу, очікуванням Користувача;</li>
                    <li className="mb-2">- за будь-які пошкодження обладнання або програмного забезпечення Користувача, що виникли в результаті використання Ресурсу;</li>
                    <li className="mb-2">- за відсутність можливості використання Ресурсу з будь-яких причин;</li>
                    <li className="mb-2">- за наслідки, які можуть спричинити поширення нелегального або неліцензійного програмного забезпечення та аудіо-/відеопродукції, а також інших матеріалів або даних, що стосуються права третіх осіб.</li>
                </ul>

                <p>Ні за яких обставин Ресурс не несе перед Користувачем, або третіми особами відповідальності за збитки, збитки чи витрати, що виникли у зв'язку з цим Ресурсом, його використанням або неможливістю використання, включаючи втрачений або недоотриманий прибуток.</p>

                <p>Користувач зобов'язується не передавати іншим особам свої персональні дані, отримані при реєстрації (логін та пароль) для входу/ідентифікації на ресурс, і несе повну відповідальність за втрату, зникнення, зникнення або передачу іншими способами персональних даних, а також за наслідки пов'язані з цим діянням. Адміністрація Ресурсу не несе відповідальності за дії третіх осіб, які скористалися персональними даними Користувача.</p>

                <p>Адміністрація Ресурсу не несе жодних зобов'язань щодо забезпечення конфіденційності щодо інформації, що надається його Користувачам, хоча вживає всіх можливих заходів до цього, якщо немає домовленості про зворотне або відповідні вимоги чинного законодавства.</p>

                <p>В обов'язки Ресурсу НЕ ВХОДИТЬ контроль легальності або нелегальності інформації, що передається, визначення прав власності або законності передачі, прийому або використання цієї інформації.</p>

                <h4 className="h4">3. Обмеження на користування ресурсом користувачем.</h4>

                <p>При використанні цього Ресурсу, КОРИСТУВАЧ не має права, і погоджується з цим:</p>

                <ul className="list-unstyled pl-4 ">
                    <li className="mb-2">- розміщувати файли або програми, призначені для порушення, знищення або обмеження функціональності будь-якого комп'ютерного або телекомунікаційного обладнання або програм, для здійснення несанкціонованого доступу, а також серійні номери до комерційних програмних продуктів та програми для їх генерації, логіни, паролі та інші засоби для отримання несанкціонованого доступу. посилання на вказану вище інформацію;</li>
                    <li className="mb-2">- розміщувати файли, що зачіпають будь-який патент, торгову марку, комерційну таємницю, копірайт або інші права власності та/або авторські та суміжні з ним права третіх осіб;</li>
                    <li className="mb-2">- надсилати на адреси електронної пошти, вказані на сайті, несанкціоновані поштові повідомлення рекламного типу (junk mail, spam);</li>
                    <li className="mb-2">- копіювати та використовувати в комерційних цілях будь-яку інформацію, одержувану за допомогою даного ресурсу, що порушує права інших Користувачів або може нанести їм прямий матеріальний або моральний
                        збитки;</li>
                    <li className="mb-2">- розміщувати посилання на ресурси Мережі, зміст яких суперечить чинному законодавству України;</li>
                    <li className="mb-2">- видавати себе за іншу людину або за представника організації та/або співтовариства без достатніх прав, у тому числі за співробітників Адміністрації, за власника Ресурсу.</li>
                </ul>

                <h4 className="h4">4. Гарантії працездатності</h4>

                <p>Доступ до Ресурсу надаються за принципом «як є» («as is») без будь-яких гарантій, як прямих, так і непрямих.</p>

                <p>Адміністрація Ресурсу не гарантує працездатність як сайту та його окремих розділів, так і працездатність і достовірність посилань, розміщених на ньому його Користувачами.</p>

                <p>Ресурс не несе відповідальності за будь-які прямі або непрямі збитки, що відбулися через: використання або неможливість використання служби; несанкціонованого доступу до Ваших комунікацій.</p>

                <h4 className="h4">5. Права адміністрації ресурсу.</h4>

                <p>Адміністрація Ресурсу має право відхилити у доступі до Ресурсу будь-якому Користувачеві або групі Користувачів без пояснення причин своїх дій та попереднього повідомлення.</p>

                <p>Адміністрація Ресурсу має право змінювати або видаляти посилання на інформацію, графічні, звукові та інші дані, розміщені Користувачами на Ресурсі, без попереднього повідомлення та пояснення причин своїх дій.</p>

                <h4 className="h4">6. Відповідальність сторін.</h4>

                <p>Користувач погоджується з тим, що всі можливі суперечки з приводу УГОДИ ПРО ВИКОРИСТАННЯ
                    вирішуватимуться за нормами відповідно до чинного законодавства.</p>

                <p>Користувач погоджується з тим, що норми та закони про захист прав споживачів не можуть бути застосовні до використання ним Ресурсу, оскільки він не надає відплатних послуг.</p>

                <p>Ресурс не встановлює з користувачами агентських відносин, відносин товариства, відносин із спільної діяльності, відносин особистого найму, а також якихось інших відносин, прямо не описаних в УГОДІ ПРО ВИКОРИСТАННЯ.</p>

                <p>Бездія з боку Ресурсу у разі порушення Користувачем або групою Користувачів КОРИСТУВАЛЬНОЇ УГОДИ не означає того, що Ресурс сприяє Користувачеві або групі Користувачів у таких діях.</p>

                <p>Бездія з боку Ресурсу у разі порушення Користувачем або групою Користувачів КОРИСТУВАЛЬНОЇ УГОДИ не позбавляє Ресурс права вжити відповідних дій на захист своїх інтересів пізніше.</p>

                <h4 className="h4">7. Згода з користувальницькою угодою.</h4>

                <p>Якщо ви не згодні з усіма вищезгаданими умовами, ви не маєте права відвідувати ресурс як загалом, так і будь-яку його частину, крім сторінки з користувальницькою угодою, отримувати та/або використовувати вміст цього ресурсу будь-якими іншими способами як загалом так і в будь-якій його частині!</p>

                <p>Якщо ви не погоджуєтесь з користувальницькою угодою, ви повинні негайно залишити ресурс.</p>

                <h4 className="h4">8. Політика конфіденційності</h4>

                <p>Адміністрація Ресурсу поважає право Користувачів на конфіденційність та захист персональних даних.</p>

                <p>При використанні Ресурсу можуть збиратися та оброблятися деякі дані Користувача, включаючи, але не обмежуючись: IP-адреса, дані браузера, файли cookie, а також інші технічні дані, необхідні для коректної роботи сайту.</p>

                <p>Персональні дані, які Користувач надає добровільно (наприклад, при реєстрації), використовуються виключно для забезпечення функціонування Ресурсу та не передаються третім особам, за винятком випадків, передбачених чинним законодавством.</p>

                <p>Ресурс може використовувати файли cookie для покращення користувацького досвіду, аналітики та персоналізації контенту.</p>

                <p>Користувач, використовуючи Ресурс, погоджується з обробкою своїх даних відповідно до цієї політики.</p>
            </div>
        </WhiteCard>
    )
}